<div class="page-title">Ошибки и предупреждения</div>
<h3 id="section1">Системные ошибки</h3>
<p?>
  Системные ошибки — это непредвиденные сбои в работе приложения, которые не обрабатываются специальными сценариями и возникают из-за внешних или внутренних факторов, не связанных с пользовательским вводом.<br>
</p>
<p>Пример 1:  <b>Ошибка «Неправильный логин и пароль»</b><br>
  Когда возникает:
</p>
<p>
  <ul>
      <li>Пользователь ввел неверные учетные данные при входе в систему</li>
      <li>Превышено количество попыток входа (макс. 3 раза)</li>
  </ul>
</p>
<p>Требуемые действия - обратить внимание и исправить:</p>
<p>
  <ul>
      <li>Проверить раскладку клавиатуры (кириллица/латиница, Caps Lock)</li>
      <li>Ввести данные заново (макс. 3 попытки)</li>
      <li>Обратиться в поддержку для восстановления пароля</li>
  </ul>
</p> 
<img class="im mgb" src="./img/error/Ошибки и предупреждения - серверные (валидация).jpg" />
<img class="im mgb" src="./img/error/Ошибки и предупреждения - бизнес-предупреждения.jpg" />
<h3 id="section2">Ошибки валидации</h3>
<img
  class="im mgb"
  src="./img/error/Ошибки и предупреждения - валидация (клиентская часть).jpg"
/>
<img
  class="im mgb"
  src="./img/error/Ошибки и предупреждения - ошибки загрузки файлов.jpg"
/>
<h3 id="section3">Серверные ошибки и предупреждения</h3>
<img class="im mgb" src="./img/error/Ошибки 500.jpg" />
<img class="im mgb" src="./img/error/Обновления.jpg" />
<img class="im mgb" src="./img/error/Ошибки и предупреждения - ошибки загрузки данных.jpg" />
<h3 id="section4">Бизнес-уведомления</h3>
<img class="im mgb" src="./img/error/Ошибки и предупреждения - бизнес-новый.jpg" />