<div class="page-title">Типовые формы CRUD сложных сущностей</div>
<h3 id="section1">Создание</h3>
<h5 id="section1">1. Создание объектов первого уровня</h5>
<p>
Объекты первого уровня:
<ul>
<li>Основным элементом интерфейса является строка таблицы (например, запись о пользователе, задаче или продукте).</li>
<li>Все действия (просмотр, редактирование, удаление) выполняются через взаимодействие со строкой.</li>
</ul>

Добавление новой строки:

<ul>
<li>Перейдите на страницу, где отображается таблица.</li>
<li>Нажмите кнопку <b>«Создать»</b> на панели действий.</li>
<li>Заполните форму на новой странице и сохраните изменения.</li>
</ul>
</p>
<img class="im mgb" src="./img/hard/sm1.jpg" />
<img class="im mgb" src="./img/hard/sm2.jpg" />
<p>Кнопки действий (<b>«Сохранить»</b>, <b>«Отмена»</b> ...) располагаются в правом нижнем углу формы, сразу после полей. Если контент объемный, то панель с кнопками действий фиксируется в нижней части экрана и остается доступной во время прокрутки контента.</p>

<h5 id="section1">2. Создание объектов второго уровня</h5>

<p>Объекты второго уровня - это сущности, вложенные в объект первого уровня (например, локация в составе заявки). Создание происходит через модальное окно при работе с родительской сущностью</p>
<img class="im mgb" src="./img/hard/sm3.jpg" />
<img class="im mgb" src="./img/hard/sm4.jpg" />

<h5 id="section1">2. Создание объектов третьего уровня</h5>

<p>Если создание объектов второго уровня происходит в модальном окне, создавать объект третьего уровня в рамках объекта второго уровня нужно в этом же модальном окне.</p>
<img class="im mgb" src="./img/hard/sm5.jpg" />
<img class="im mgb" src="./img/hard/sm6.jpg" />

<h3 id="section2">Редактирование</h3>

<p>Для редактирования  содержимого строки нажмите иконку <b>«Изменить»</b>, которая расположена в конце каждой строки.</p>
<img class="im mgb" src="./img/hard/sm7.jpg" />
<p>После внесения изменений нажмите <b>«Сохранить»</b> — произойдет возврат к таблице</p>
<img class="im mgb" src="./img/hard/sm8.jpg" />

<h3 id="section3">Удаление</h3>

<p>
  Удаление одной строки происходит нажатием на иконку <b>«Удалить»</b>,
  которая располагается в конце каждой строки.
</p>
<img class="im mgb" src="./img/hard/sm9.jpg" />
<p>
  Удалите несколько строк сразу: отметьте флажки слева и нажмите
  <b>«Удалить»</b> на панели действий.
</p>
<img class="im mgb" src="./img/hard/sm10.jpg" />
<img class="im mgb" src="./img/hard/sm11.jpg" />


